# BoundaryParamPreset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BoundaryParamPreset Property
ParameterTypeId Class See Also
---
"State"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BoundaryParamPreset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BoundaryParamPreset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BoundaryParamPreset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace